Repository: WapplerSystems/ws_slider
Catalog: Resources/Private/Language/*.flexslider.xlf
Languages: de

# sheet.usability
source: Usability
de: Benutzbarkeit

# sheet.primaryControls
source: Primary Controls
de: Primäre Steuerelemente

# sheet.secondaryNavigation
source: Secondary Navigation
de: Sekundäre Navigation

# sheet.specialProperties
source: Special Properties
de: Besondere Eigenschaften

# sheet.carousel
source: Carousel
de: Karussell

# settings.selector
source: Selector
de: Selektor

# settings.easing
source: Easing effect
de: Easing Effekt

# settings.direction
source: Direction
de: Richtung

# settings.reverse
source: Reverse order
de: Umgekehrte Reihenfolge

# settings.animationLoop
source: Animation loop
de: Animationsschleife

# settings.smoothHeight
source: Smooth height
de: Glatte Höhenverstellung zwischen Elementen

# settings.startAt
source: Start at
de: Start bei

# settings.slideshow
source: Slideshow mode
de: Diashow-Modus

# settings.slideshowSpeed
source: Slideshow speed (in milliseconds)
de: Diashow-Geschwindigkeit (in Millisekunden)

# settings.animationSpeed
source: Animation speed (in milliseconds)
de: Animationsgeschwindigkeit (in Millisekunden)

# settings.initDelay
source: Init delay in milliseconds
de: Start-Verzögerung in Millisekunden

# settings.randomize
source: Random mode
de: Zufallsmodus

# settings.fadeFirstSlide
source: Fade in first slide
de: Einblenden des ersten Elements

# settings.fade
source: Fade
de: Überblenden

# settings.pauseOnAction
source: Pause on action
de: Bei Aktion pausieren

# settings.pauseOnHover
source: Pause on hover
de: Pausieren beim Darüberfahren

# settings.pauseInvisible
source: Pause Invisible
de: Pausieren falls Fenster nicht sichtbar ist

# settings.useCSS
source: User CSS
de: Benutzer-CSS

# settings.touch
source: Touch mode
de: Berührungsmodus

# settings.video
source: Video mode
de: Video-Modus

# settings.keyboard
source: Keyboard support
de: Tastaturunterstützung

# settings.multipleKeyboard
source: Allow keyboard navigation to affect multiple sliders
de: Tastatursteuerung soll mehrere slider beeinflussen

# settings.mousewheel
source: Mousewheel support (requires jquery.mousewheel.js)
de: Mausrad-Unterstützung (benötigt jquery.mousewheel.js)

# settings.pausePlay
source: Create pause/play dynamic element
de: Dynamisches Element für pausieren/abspielen

# settings.controlsContainer
source: controlsContainer jQuery object/selector
de: controlsContainer jQuery Objekt/Selektor

# settings.manualControls
source: manualControls jQuery object/selector
de: controlsContainer jQuery Objekt/Selektor

# settings.customDirectionNav
source: customDirectionNav jQuery object/selector
de: customDirectionNav jQuery Objekt/Selektor

# settings.sync
source: Sync selector: mirror the actions performed on this slider with another slider
de: Sync-Selektor: Spiegeln Sie die auf diesem Slider durchgeführten Aktionen auf einem anderen Slider

# settings.asNavFor
source: asNavFor selector
de: asNavFor Selektor

# settings.itemWidth
source: Element width in pixels
de: Elementbreite in Pixeln

# settings.itemMargin
source: Element border (margin)
de: Elementrahmen (Rand)

# settings.minItems
source: Min number of elements
de: Minimale Anzahl von Elementen

# settings.maxItems
source: Max number of elements
de: Maximale Anzahl von Elementen

# settings.move
source: Number of elements, which should be moved in animation
de: Anzahl der Elemente, die in der Animation verschoben werden sollen
