Repository: WapplerSystems/ws_slider
Catalog: Resources/Private/Language/*.flexslider_csh_flexforms.xlf
Languages: de

# flexslider.settings.js.selector.description
source: Must match a simple pattern. '{container} > {slide}'.
de: Muss mit einem einfachen Muster übereinstimmen. '{container} > {slide}'.

# flexslider.settings.js.animation.description
source: Controls the animation type, "fade" or "slide".
de: Steuert den Animationstyp, "fade" oder "slide".

# flexslider.settings.js.easing.description
source: Determines the easing method used in jQuery transitions.
de: Bestimmt die easing Methode, die bei jQuery Übergängen verwendet wird.

# flexslider.settings.js.direction.description
source: Controls the animation direction, "horizontal" or "vertical"
de: Steuert die Animationsrichtung, "horizontal" oder "vertikal".

# flexslider.settings.js.reverse.description
source: Reverse the animation direction.
de: Navigationsrichtung umkehren.

# flexslider.settings.js.animationLoop.description
source: Gives the slider a seamless infinite loop.
de: Slider bildet eine Endlosschleife.

# flexslider.settings.js.smoothHeight.description
source: Animate the height of the slider smoothly for slides of varying height.
de: Animiert die Höhe des Sliders dynamisch je nach Höhe der einzelnen Elemente.

# flexslider.settings.js.startAt.description
source: The starting slide for the slider, in array notation.
de: Startelement in Array-Notation (erstes Element hat index 0).

# flexslider.settings.js.slideshow.description
source: Setup a slideshow for the slider to animate automatically.
de: Richten Sie eine Slideshow ein, damit der Slider automatisch animiert wird.

# flexslider.settings.js.slideshowSpeed.description
source: Set the speed of the slideshow cycling, in milliseconds.
de: Legen Sie die Geschwindigkeit für das Fortlaufen der Slideshow in Millisekunden fest.

# flexslider.settings.js.animationSpeed.description
source: Set the speed of animations, in milliseconds.
de: Legen Sie die Geschwindigkeit von Animationen in Millisekunden fest.

# flexslider.settings.js.initDelay.description
source: Set an initialization delay, in milliseconds.
de: Setzen Sie eine Initialisierungsverzögerung in Millisekunden.

# flexslider.settings.js.randomize.description
source: Randomize slide order, on load.
de: Zufällige Folienreihenfolge, wird beim Laden festgelegt.

# flexslider.settings.js.fadeFirstSlide.description
source: Fade in animation on the first slide.
de: Einblendeanimation auf dem ersten Element.

# flexslider.settings.js.pauseOnAction.description
source: Pause the slideshow when interacting with control elements.
de: Pausiert die Slideshow bei Interaktion mit Steuerelementen.

# flexslider.settings.js.pauseOnHover.description
source: Pause the slideshow when hovering over slider, then resume when no longer hovering.
de: Pausiert die Slideshow wenn der Mauszeiger über dem Slider schwebt.

# flexslider.settings.js.pauseInvisible.description
source: Pause Invisible
de: Pausieren falls Fenster nicht sichtbar ist.

# flexslider.settings.js.useCSS.description
source: Slider will use CSS3 transitions, if available.
de: Slider verwendet CSS3-Übergänge, falls verfügbar.

# flexslider.settings.js.touch.description
source: Allow touch swipe navigation of the slider on enabled devices.
de: Ermöglicht Touch-Steuerung.

# flexslider.settings.js.video.description
source: Will prevent use of CSS3 3D Transforms, avoiding graphical glitches when there is video in the slider.
de: Verhindert die Verwendung von CSS3 3D Transformationen, um graphische Störungen zu vermeiden, wenn es Video im Slider gibt.

# flexslider.settings.js.controlNav.description
source: Create navigation for paging control of each slide.
de: Erstelle Navigation zur Seitensteuerung jeder Folie.

# flexslider.settings.js.directionNav.description
source: Create previous/next arrow navigation.
de: "Vorherige/Nächste" Pfeilnavigation aktivieren.

# flexslider.settings.js.keyboard.description
source: Allow slider navigating via keyboard left/right keys.
de: Erlaube das Navigieren des Sliders über die Pfeiltasten links/rechts.

# flexslider.settings.js.multipleKeyboard.description
source: Allow keyboard navigation to affect multiple sliders.
de: Tastatursteuerung soll mehrere Slider gleichzeitig beeinflussen.

# flexslider.settings.js.mousewheel.description
source: (Dependency) Allows slider navigating via mousewheel
de: (Dependency) Erlaubt Mausradsteuerung

# flexslider.settings.js.pausePlay.description
source: Create pause/play element to control slider slideshow.
de: Erstelle Pause/Play-Element zur Steuerung der Slider-Diashow.

# flexslider.settings.js.controlsContainer.description
source: jQuery Object/Selector. Container the navigation elements should be appended to.
de: jQuery Objekt/Selektor. Container in die die Navigationselemente eingebettet werden.

# flexslider.settings.js.manualControls.description
source: jQuery Object/Selector. Define element to be used in lieu of dynamic controlNav.
de: jQuery Objekt/Selektor. Definieren Sie das zu verwendende Element anstelle von dynamischer Steuerung.

# flexslider.settings.js.sync.description
source: Selector. Mirror the actions performed on this slider with another slider.
de: Sync-Selektor: Spiegeln Sie die auf diesem Slider durchgeführten Aktionen auf einem anderen Slider.

# flexslider.settings.js.asNavFor.description
source: Selector. Turn the slider into a thumbnail navigation for another slider.
de: Selektor. Benutzen Sie diesen Schieberegler als eine Miniaturansicht für einen anderen Schieberegler.

# flexslider.settings.js.itemWidth.description
source: Box-model width of individual carousel items, including horizontal borders and padding.
de: Box-Modell Breite der einzelnen Elemente, einschließlich horizontaler border und padding.

# flexslider.settings.js.itemMargin.description
source: Margin between carousel items.
de: Abstand zwischen Elementen.

# flexslider.settings.js.minItems.description
source: Minimum number of carousel items that should be visible.
de: Mindestanzahl der Elemente, die sichtbar sein sollen.

# flexslider.settings.js.maxItems.description
source: Maximum number of carousel items that should be visible.
de: Maximale Anzahl der Elemente, die sichtbar sein sollen.

# flexslider.settings.js.move.description
source: Number of carousel items that should move on animation.
de: Anzahl der Elemente die sich verschieben sollten bei Animation.
