Repository: WapplerSystems/ws_slider
Catalog: Resources/Private/Language/*.owl_csh_flexforms.xlf
Languages: de

# owl.settings.js.items.description
source: The number of items you want to see on the screen.
de: Die Anzahl der Elemente, die Sie auf dem Bildschirm sehen möchten.

# owl.settings.js.responsive.0.items.description
source: Items below 576px display width
de: Elemente unterhalb 576px Displaybreite

# owl.settings.js.responsive.576.items.description
source: Items above 576px display width
de: Elemente oberhalb 576px Displaybreite

# owl.settings.js.responsive.768.items.description
source: Items above 768px display width
de: Elemente oberhalb 768px Displaybreite

# owl.settings.js.responsive.992.items.description
source: Items above 992px display width
de: Elemente oberhalb 992px Displaybreite

# owl.settings.js.responsive.1200.items.description
source: Items above 1200px display width
de: Elemente oberhalb 1200px Displaybreite

# owl.settings.js.responsive.1400.items.description
source: Items above 1400px display width
de: Elemente oberhalb 1400px Displaybreite

# owl.settings.js.margin.description
source: margin-right(px) on item.
de: margin-right(px) von Element.

# owl.settings.js.loop.description
source: Infinity loop. Duplicate last and first items to get loop illusion.
de: Endlosschleife. Dupliziere die letzten und ersten Elemente, um eine Schleifen-Illusion zu erhalten.

# owl.settings.js.center.description
source: Center item. Works well with even an odd number of items.
de: Element zentrieren. Funktioniert auch mit einer ungeraden Elementanzahl gut.

# owl.settings.js.mouseDrag.description
source: Mouse drag enabled.
de: Maus Steuerung aktivieren.

# owl.settings.js.touchDrag.description
source: Touch drag enabled.
de: Touch Steuerung aktivieren.

# owl.settings.js.stagePadding.description
source: Padding left and right on stage (can see neighbours).
de: Innerer Abstand links und rechts des Sliders.

# owl.settings.js.autoWidth.description
source: Set non grid content. Try using width style on divs.
de: Automatische Breite. Andernfalls versuchen sie width Attribute auf divs.

# owl.settings.js.startPosition.description
source: Start position or URL Hash string like '#id'.
de: Start-Position oder URL-Hash String z.B. '#id'.

# owl.settings.js.URLhashListener.description
source: Listen to url hash changes. data-hash on items is required.
de: Auf URL-Hash Änderungen achten. data-hash auf Elementen ist erforderlich.

# owl.settings.js.nav.description
source: Show next/prev buttons.
de: "Nächste/Vorherige" Steuerungs-Buttons anzeigen.

# owl.settings.js.rewind.description
source: Go backwards when the boundary has reached.
de: Gehe rückwärts, wenn das Ende erreicht wurde.

# owl.settings.js.navElement.description
source: DOM element type for a single directional navigation link.
de: DOM-Element-Typ für einen einzigen direktionalen Navigationslink.

# owl.settings.js.slideBy.description
source: Navigation slide by x. 'page' string can be set to slide by page.
de: Navigation verschiebt um x Elemente. Der String 'page' kann gesetzt werden wenn um eine komplette Seite verschoben werden soll.

# owl.settings.js.slideTransition.description
source: You can define the transition for the stage you want to use eg. linear.
de: Sie können die Übergänge des Sliders definieren. z.B. linear.

# owl.settings.js.dots.description
source: Show dots navigation.
de: Zeige Navigationspunkte.

# owl.settings.js.dotsEach.description
source: Show dots each x item.
de: Zeige einen Punkt für alle x Elemente.

# owl.settings.js.lazyLoad.description
source: Lazy load images. data-src and data-src-retina for highres. Also load images into background inline style if element is not <img>
de: Lazy loading der Bilder.

# owl.settings.js.lazyLoadEager.description
source: Eagerly pre-loads images to the right (and left when loop is enabled) based on how many items you want to preload.
de: Bilder nach rechts vorladen (und nach links, falls Schleife aktiviert ist), basierend auf der Anzahl der Elemente die Sie hier angeben.

# owl.settings.js.autoplayTimeout.description
source: Autoplay interval timeout.
de: Timeout für Autoplay-Intervall.

# owl.settings.js.autoplayHoverPause.description
source: Pause on mouse hover.
de: Pause beim Mouse-Hover.

# owl.settings.js.autoplaySpeed.description
source: autoplay speed.
de: Autoplay-Geschwindigkeit.

# owl.settings.js.navSpeed.description
source: Navigation speed.
de: Navigationsgeschwindigkeit.

# owl.settings.js.dotsSpeed.description
source: Pagination speed.
de: Geschwindigkeit der Punktenavigation.

# owl.settings.js.dragEndSpeed.description
source: Drag end speed.
de: Geschwindigkeit in der der slider zum Stillstand kommt nachdem er gezogen wurde.

# owl.settings.js.responsiveRefreshRate.description
source: Responsive refresh rate.
de: Responsive Aktualisierungsrate. (Zeit bis der slider sich anpasst in ms)

# owl.settings.js.video.description
source: Enable fetching YouTube/Vimeo/Vzaar videos.
de: Aktiviere das Abrufen von YouTube/Vimeo/Vzaar-Videos.

# owl.settings.js.videoHeight.description
source: Set height for videos.
de: Höhe für Videos festlegen.

# owl.settings.js.videoWidth.description
source: Set width for videos.
de: Breite für Videos festlegen.

# owl.settings.js.animateOut.description
source: Class for CSS3 animation out.
de: Klasse für CSS3 Ausgangsanimation.

# owl.settings.js.animateIn.description
source: Class for CSS3 animation in.
de: Klasse für CSS3 Introanimation.

# owl.settings.js.fallbackEasing.description
source: Easing for CSS2 $.animate.
de: Easing für CSS2 $.animate.

# owl.settings.js.nestedItemSelector.description
source: Use it if owl items are deep nested inside some generated content. E.g 'youritem'. Dont use dot before class name.
de: Benutzen Sie diese Option falls OWL Elemente tief in generierten Inhalten eingebettet ist. Z.B. 'youritem'. Keinen Punkt vor den Klassennamen setzen.

# owl.settings.js.itemElement.description
source: DOM element type for owl-item.
de: DOM-Elementtyp für owl-Element.

# owl.settings.js.stageElement.description
source: DOM element type for owl-stage.
de: DOM-Elementtyp für owl-Karussell.

# owl.settings.js.navContainer.description
source: Set your own container for nav.
de: Setzen Sie einen eigenen container für nav Elemente.

# owl.settings.js.dotsContainer.description
source: Set your own container for nav.
de: Setzen Sie einen eigenen container für die Punktenavigation.

# owl.settings.js.checkVisible.description
source: If you know the carousel will always be visible you can set `checkVisibility` to `false` to prevent the expensive browser layout forced reflow the $element.is(':visible') does.
de: Wenn du weißt, dass das Karussell immer sichtbar sein wird, kannst du diese Option auf `false` setzen, um die teure $element.is(':visible') Methode zu verhindern.
