Repository: WapplerSystems/ws_slider
Catalog: Resources/Private/Language/*.owlslider.xlf
Languages: de

# settings.items
source: Items
de: Elemente

# settings.responsiveItemCount0
source: Items below 576px display width
de: Elemente unterhalb 576px Displaybreite

# settings.responsiveItemCount576
source: Items above 576px display width
de: Elemente oberhalb 576px Displaybreite

# settings.responsiveItemCount768
source: Items above 768px display width
de: Elemente oberhalb 768px Displaybreite

# settings.responsiveItemCount992
source: Items above 992px display width
de: Elemente oberhalb 992px Displaybreite

# settings.responsiveItemCount1200
source: Items above 1200px display width
de: Elemente oberhalb 1200px Displaybreite

# settings.stagePadding
source: Stage Padding
de: Slider Padding

# settings.center
source: Center item
de: Element zentrieren

# settings.mouseDrag
source: Mouse Drag
de: Maus-Steuerung

# settings.touchDrag
source: Touch Drag
de: Touch-Steuerung

# settings.autoWidth
source: Auto Width
de: Automatische Breite

# settings.rewind
source: Rewind
de: Zurückspulen

# settings.slideBy
source: Slide By
de: Um x Elemente verschieben

# settings.slideTransition
source: Slide Transition
de: Elementübergang

# settings.autoplayTimeout
source: Autoplay interval timeout
de: Timeout für Autoplay-Intervall

# settings.autoplayHoverPause
source: Autoplay pause on hover
de: Autoplay pausieren bei Hover

# settings.dragEndSpeed
source: Drag end speed
de: Zieh Endgeschwindigkeit

# settings.videoHeight
source: Video Height
de: Video Höhe

# settings.videoWidth
source: Video Width
de: Video-Breite

# settings.fallbackEasing
source: Easing fallback animation for CSS2
de: Easing Fallback-Animation für CSS2

# settings.nestedItemSelector
source: Nested Item Selector
de: Element-Selektor für verschachtelte Elemente

# settings.stageElement
source: Stage Element
de: Karussell Element

# settings.navContainer
source: Nav Container
de: Navigationscontainer

# settings.navSpeed
source: Nav Speed
de: Navigatonsgeschwindigkeit

# settings.nav
source: Show Nav Buttons
de: Navigations-Buttons anzeigen

# settings.dotsContainer
source: Dots Container
de: Punktenavigation Container

# settings.dots
source: Show navigation dots
de: Punktenavigation anzeigen

# settings.dotsEach
source: Show dots each x item
de: Punkteaufteilung

# settings.dotsSpeed
source: Dots Speed
de: Punktenavigationsgeschwindigkeit

# settings.checkVisible
source: Check Visible
de: Sichtbarkeit Prüfen

# settings.responsiveRefreshRate
source: Responsive Refresh Rate
de: Responsive Aktualisierungsrate

# settings.URLhashListener
source: Listen to url hash changes
de: URL-Hash-Änderungen
