Repository: WapplerSystems/ws_slider
Catalog: Resources/Private/Language/*.slickslider.xlf
Languages: de

# settings.accessibility
source: Accessibility
de: Steuerungselemente aktivieren

# settings.arrows
source: Arrows
de: Pfeilsymbole

# settings.asNavFor
source: As Nav For
de: Als Navigation für anderen Slider benutzen

# settings.appendArrows
source: Append Arrows
de: Pfeile anhängen

# settings.appendDots
source: Append Dots
de: Punkte anhängen

# settings.prevArrow
source: Prev Arrow
de: "Vorherige"-Pfeil

# settings.nextArrow
source: Next Arrow
de: "Nächste"-Pfeil

# settings.centerMode
source: Center Mode
de: Zentrierungsmodus

# settings.centerPadding
source: Center Padding
de: Innerer Abstand im Zentrierungsmodus

# settings.dots
source: Dots
de: Punktenavigation

# settings.dotsClass
source: Dots Class
de: CSS-Klasse der Punktenavigation

# settings.draggable
source: Draggable
de: Ziehbar

# settings.fade
source: Fade
de: Überblenden

# settings.focusOnSelect
source: Focus On Select
de: Fokus auf Auswahl

# settings.edgeFriction
source: Edge Friction
de: Kantenreibung

# settings.infinite
source: Infinite
de: Endlosschleife

# settings.initialSlide
source: Initial Slide
de: Startelement

# settings.mobileFirst
source: Mobile First
de: Priorität für Mobilgeräte

# settings.pauseOnFocus
source: Pause on focus
de: Pausieren bei Fokus

# settings.pauseOnHover
source: Pause on hover
de: Pausieren beim Darüberfahren

# settings.pauseOnDotsHover
source: Pause on Dots hover
de: Pausieren wenn Zeiger über Punktenavigation ist

# settings.respondTo
source: Respond To
de: Responsive Breite

# settings.rows
source: Rows
de: Zeilen

# settings.slidesPerRow
source: Slides per row
de: Elemente pro Reihe

# settings.slidesToShow
source: Slides to show
de: Anzahl Elemente die gezeigt werden

# settings.slidesToScroll
source: Slides to Scroll
de: Anzahl Elemente die verschoben werden bei Aktion

# settings.speed
source: Slide/Fade animation speed
de: Slide/Fade Animationsgeschwindigkeit

# settings.swipe
source: Enable swiping
de: Wischen aktivieren

# settings.swipeToSlide
source: Swipe to slide
de: Direkt zu Element wischen

# settings.touchMove
source: Touch Move
de: Touch Funktionalität aktivieren

# settings.touchThreshold
source: Touch Threshold
de: Touch-Schwellenwert

# settings.useCSS
source: Enable CSS Transitions
de: CSS-Übergänge aktivieren

# settings.useTransform
source: Enable CSS Transform
de: CSS-Transformation aktivieren

# settings.variableWidth
source: Variable Width
de: Variable Breite

# settings.vertical
source: Vertical slide mode
de: Vertikaler Slide-Modus

# settings.verticalSwiping
source: Vertical swipe mode
de: Vertikaler Wischmodus

# settings.rtl
source: Right-to-left slider
de: Rechts nach links

# settings.waitForAnimate
source: Wait for animate
de: Warte auf Animation

# settings.zindex
source: Z-Index value for slides
de: Z-Indexwert für Elemente
