Repository: WapplerSystems/ws_slider
Catalog: Resources/Private/Language/*.slick_csh_flexforms.xlf
Languages: de

# slick.settings.js.accessibility.description
source: Enables tabbing and arrow key navigation
de: Aktiviert Tabbing und Pfeiltasten Navigation

# slick.settings.js.adaptiveHeight.description
source: Enables adaptive height for single slide horizontal carousels.
de: Aktiviert adaptive Höheneinstellung für einzelne Elemente in horizontalen Karussellen.

# slick.settings.js.autoplay.description
source: Enables Autoplay
de: Aktiviert Autoplay

# slick.settings.js.autoplaySpeed.description
source: Autoplay Speed in milliseconds
de: Autoplay-Geschwindigkeit in Millisekunden

# slick.settings.js.arrows.description
source: Prev/Next Arrows
de: "Vorherige/Nächste" Pfeile

# slick.settings.js.asNavFor.description
source: Set the slider to be the navigation of other slider (Class or ID Name)
de: Diesen Slider als Navigation für einen anderen Slider verwenden (Klasse oder ID)

# slick.settings.js.appendArrows.description
source: Change where the navigation arrows are attached (Selector, htmlString, Array, Element, jQuery object)
de: Ändere wo die Navigationspfeile eingebettet werden (Selektor, htmlString, Array, Element, jQuery object)

# slick.settings.js.appendDots.description
source: Change where the navigation dots are attached (Selector, htmlString, Array, Element, jQuery object)
de: Ändere wo die Navigationspunkte eingebettet werden (Selektor, htmlString, Array, Element, jQuery object)

# slick.settings.js.prevArrow.description
source: Allows you to select a node or customize the HTML for the "Previous" arrow.
de: Erlaubt Ihnen, einen Knoten auszuwählen oder das HTML für den "Vorherige" Pfeil anzupassen.

# slick.settings.js.nextArrow.description
source: Allows you to select a node or customize the HTML for the "Next" arrow.
de: Erlaubt Ihnen, einen Knoten auszuwählen oder das HTML für den "Weiter"-Pfeil anzupassen.

# slick.settings.js.centerMode.description
source: Enables centered view with partial prev/next slides. Use with odd numbered slidesToShow counts.
de: Aktiviert die zentrierte Ansicht mit partiellen Vorherige/Nächste Elemente. Sollte mit einer ungerade Anzahl sichtbarer Elemente verwendet werden.

# slick.settings.js.centerPadding.description
source: Side padding when in center mode (px or %)
de: Seiten-Padding im zentrierten Modus (px oder %)

# slick.settings.js.dots.description
source: Show dot indicators
de: Zeige Punkte-Navigation

# slick.settings.js.dotsClass.description
source: Class for slide indicator dots container
de: Klasse für Punktenavigation

# slick.settings.js.draggable.description
source: Enable mouse dragging
de: Maus-Ziehen aktivieren

# slick.settings.js.fade.description
source: Enable fade
de: Überblenden aktivieren

# slick.settings.js.focusOnSelect.description
source: Enable focus on selected element (click)
de: Aktiviere Fokus auf das ausgewählte Element (Klick)

# slick.settings.js.easing.description
source: Add easing for jQuery animate. Use with easing libraries or default easing methods
de: Easing für jQuery animate. Mit easing Bibliotheken benutzen oder standard easing methoden

# slick.settings.js.edgeFriction.description
source: Resistance when swiping edges of non-infinite carousels
de: Widerstand beim Wischen von Kanten von endlichen Karussellen

# slick.settings.js.infinite.description
source: Infinite loop sliding
de: Karussell bildet eine Endlosschleife

# slick.settings.js.initialSlide.description
source: Slide to start on
de: Startelement

# slick.settings.js.lazyLoad.description
source: Set lazy loading technique. Accepts 'ondemand' or 'progressive'
de: Aktiviert lazy loading. Akzeptiert 'ondemand' oder 'progressive'

# slick.settings.js.mobileFirst.description
source: Responsive slick.settings use mobile first calculation
de: Responsive slick.settings priorisieren Einstellungen für Mobilgeräte

# slick.settings.js.pauseOnFocus.description
source: Pause Autoplay On Focus
de: Autoplay bei Fokus pausieren

# slick.settings.js.pauseOnHover.description
source: Pause Autoplay On Hover
de: Autoplay bei Hover pausieren

# slick.settings.js.pauseOnDotsHover.description
source: Pause Autoplay when a dot is hovered
de: Autoplay pausieren, wenn der mauszeiger über einem der Punkte aus der Punktenavigation schwebt

# slick.settings.js.respondTo.description
source: Width that responsive object responds to. Can be 'window', 'slider' or 'min' (the smaller of the two)
de: Breite auf die das responsive Objekt reagiert. Kann 'window', 'slider' oder 'min' sein

# slick.settings.js.rows.description
source: Setting this to more than 1 initializes grid mode. Use slidesPerRow to set how many slides should be in each row.
de: Einstellung auf mehr als 1 initialisiert den Rastermodus. Verwenden Sie die Option 'Elemente pro Reihe', um festzulegen, wie viele Elemente in jeder Zeile angezeigt werden sollen.

# slick.settings.js.slidesPerRow.description
source: With grid mode intialized via the rows option, this sets how many slides are in each grid row.
de: Wenn der Rastermodus über die Zeilen-Option intialisiert wird, legt dies fest, wie viele Folien in jeder Zeile liegen.

# slick.settings.js.slidesToShow.description
source: # of slides to show
de: Anzahl an angezeigten Elementen

# slick.settings.js.slidesToScroll.description
source: # of slides to scroll
de: Anzahl Elemente die verschoben werden bei Aktion

# slick.settings.js.speed.description
source: Slide/Fade animation speed
de: Slide/Fade Animationsgeschwindigkeit

# slick.settings.js.swipe.description
source: Enable swiping
de: Wischen aktivieren

# slick.settings.js.swipeToSlide.description
source: Allow users to drag or swipe directly to a slide irrespective of slidesToScroll
de: Benutzern erlauben, unabhängig von der festgelegten Anzahl der Elemente die bei einer Aktion verschoben werden direkt auf eine Folie zu ziehen oder zu wischen

# slick.settings.js.touchMove.description
source: Enable slide motion with touch
de: Wischen durch touch-Eingaben aktivieren

# slick.settings.js.touchThreshold.description
source: To advance slides, the user must swipe a length of (1/touchThreshold) * the width of the slider
de: Um Folien vorzuschieben, muss der Benutzer eine Länge von (1/touchThreshold) * der Breite des Schiebereglers wischen

# slick.settings.js.useCSS.description
source: Enable/Disable CSS Transitions
de: CSS-Übergänge aktivieren/deaktivieren

# slick.settings.js.useTransform.description
source: Enable/Disable CSS Transforms
de: CSS-Transformationen aktivieren/deaktivieren

# slick.settings.js.variableWidth.description
source: Variable width slides
de: Elemente haben variable Breite

# slick.settings.js.vertical.description
source: Vertical slide mode
de: Vertikaler Slide-Modus

# slick.settings.js.verticalSwiping.description
source: Vertical swipe mode
de: Vertikaler Wischmodus

# slick.settings.js.rtl.description
source: Change the slider's direction to become right-to-left
de: Ändert die Richtung des Schiebereglers auf rechts nach links

# slick.settings.js.waitForAnimate.description
source: Ignores requests to advance the slide while animating
de: Ignoriert Anfragen, um die Elemente während der Animation voranzutreiben

# slick.settings.js.zindex.description
source: Set the zIndex values for slides, useful for IE9 and lower
de: ZIndex-Werte für Elemente einstellen, nützlich für IE9 und niedriger
