Repository: WapplerSystems/ws_slider
Catalog: Resources/Private/Language/*.tinyslider_csh_flexforms.xlf
Languages: de

# tinyslider.settings.js.mode.description
source: Controls animation behaviour. With carousel everything slides to the side, while gallery uses fade animations and changes all slides at once.
de: Kontrolliert das Animationsverhalten. Bei 'karussell' verschiebt sich alles zur Seite. Bei 'galerie' werden Animationen für Überblenden verwendet und alle Elemente werden gleichzeitig verändert.

# tinyslider.settings.js.axis.description
source: The axis of the slider.
de: Die Achse des Sliders.

# tinyslider.settings.js.items.description
source: Number of slides being displayed in the viewport. If slides less or equal than items, the slider won't be initialized
de: Anzahl der Folien die im Viewport angezeigt werden. Wenn die Anzahl der Elemente kleiner oder gleich als die hier angegebene Anzahl sind, wird der slider nicht initialisiert

# tinyslider.settings.js.gutter.description
source: Space between slides (in “px”).
de: Abstand zwischen Elementen (in „px“).

# tinyslider.settings.js.edgePadding.description
source: Space on the outside (in “px”).
de: Padding außerhalb (in px).

# tinyslider.settings.js.fixedWidth.description
source: Controls width attribute of the slides.
de: Steuert das Breitenattribut der Elemente.

# tinyslider.settings.js.autoWidth.description
source: If true, the width of each slide will be its natural width as an inline-block box.
de: Falls aktiviert, ist die Breite jedes Elements als Inline-Block die natürliche Breite der Folie.

# tinyslider.settings.js.viewportMax.description
source: Maximum viewport width for fixedWidth/autoWidth.
de: Maximale Viewportbreite für die feste/automatische Breite.

# tinyslider.settings.js.slideBy.description
source: Number of slides going on one “click”.
de: Anzahl der Elemente die verschoben werden bei einer Aktion.

# tinyslider.settings.js.center.description
source: Center the active slide in the viewport.
de: Zentriert die aktive Folie.

# tinyslider.settings.js.controls.description
source: Controls the display and functionalities of controls components (prev/next buttons). If true, display the controls and add all functionalities. For better accessibility, when a prev/next button is focused, user will be able to control the slider using left/right arrow keys.
de: Kontrolliert die Sichtbarkeit und Funktionalität der Kontrollkomponenten (Vorherige/Nächste buttons). Falls aktiviert, werden alle Kontrollkomponenten aktiviert. Für bessere Benutzbarkeit ist Kontrolle über linker/rechter Pfeiltaste möglich wenn einer der Vorherige/Nächste Buttons fokussiert ist.

# tinyslider.settings.js.controlsPosition.description
source: Controls controls position.
de: Positionen der Kontrollschaltflächen.

# tinyslider.settings.js.controlsContainer.description
source: The container element/selector around the prev/next buttons. controlsContainer must have at least 2 child elements.
de: Das container Element/Selektor um die Vorherige/Nächste Buttons. Muss mindestens 2 untergeordnete Elemente haben.

# tinyslider.settings.js.prevButton.description
source: Customized previous buttons. This option will be ignored if controlsContainer is a Node element or a CSS selector.
de: Benutzerdefinierter "Vorherige"-Button. Diese Option wird ignoriert falls der Container der Kontrollelemente ein Node Element oder ein CSS Selektor ist.

# tinyslider.settings.js.nextButton.description
source: Customized next buttons. This option will be ignored if controlsContainer is a Node element or a CSS selector.
de: Benutzerdefinierter "Nächste"-Button. Diese Option wird ignoriert falls der Container der Kontrollelemente ein Node Element oder ein CSS Selektor ist.

# tinyslider.settings.js.nav.description
source: Controls the display and functionalities of nav components (dots). If true, display the nav and add all functionalities.
de: Aktiviert die Navigationspunkte.

# tinyslider.settings.js.navPosition.description
source: Controls nav position.
de: Positionen der Kontrollelemente.

# tinyslider.settings.js.navContainer.description
source: The container element/selector around the dots. navContainer must have at least same number of children as the slides.
de: Das Containerelement/Selektor um die Navigationspunkte.

# tinyslider.settings.js.navAsThumbnail.description
source: Indicate if the dots are thumbnails. If true, they will always be visible even when more than 1 slides displayed in the viewport.
de: Geben Sie an, ob es sich bei den Punkten um Thumbnails handelt. Wenn ja, sind sie immer sichtbar, auch wenn mehr als 1 Element im Viewport angezeigt wird.

# tinyslider.settings.js.arrowKeys.description
source: Allows using arrow keys to switch slides.
de: Ermöglicht das Wechseln von Folien mit Pfeiltasten.

# tinyslider.settings.js.speed.description
source: Speed of the slide animation (in “ms”).
de: Geschwindigkeit der Folienanimation (in „ms“).

# tinyslider.settings.js.autoplay.description
source: Toggles the automatic change of slides.
de: Schaltet den automatische Wechsel der Folien an.

# tinyslider.settings.js.autoplayPosition.description
source: Controls autoplay position.
de: Kontrolliert die Autoplay Position.

# tinyslider.settings.js.autoplayTimeout.description
source: Time between 2 autoplay slides change (in “ms”).
de: Zeit zwischen 2 Autoplay-Folien ändern (in „ms“).

# tinyslider.settings.js.autoplayDirection.description
source: Direction of slide movement (ascending/descending the slide index).
de: Richtung der Folienbewegung (aufsteigen/absteigend des Folienindex).

# tinyslider.settings.js.autoplayHoverPause.description
source: Stops sliding on mouseover.
de: Stoppt Autoplay wenn der Mauszeiger über dem slider schwebt.

# tinyslider.settings.js.autoplayButton.description
source: The customized autoplay start/stop button or selector.
de: Benutzerdefinierter Autotoplay Start-/Stop-Button oder Selektor.

# tinyslider.settings.js.autoplayResetOnVisibility.description
source: Pauses the sliding when the page is invisible and resumes it when the page become visiable again.
de: Pausiert Autoplay wenn die Seite nicht sichtbar ist und führt es fort sobald die Seite wieder sichtbar ist.

# tinyslider.settings.js.animateIn.description
source: Name of intro animation class.
de: Name der Intro Animationsklasse.

# tinyslider.settings.js.animateOut.description
source: Name of outro animation class.
de: Name der Outro Animationsklasse.

# tinyslider.settings.js.animateNormal.description
source: Name of default animation class.
de: Name der Standard Animationsklasse.

# tinyslider.settings.js.animateDelay.description
source: Time between each gallery animation (in “ms”).
de: Zeit zwischen jeder Galerieanimation (in „ms“).

# tinyslider.settings.js.loop.description
source: Moves throughout all the slides seamlessly.
de: Slider bildet eine Endlosschleife.

# tinyslider.settings.js.rewind.description
source: Moves to the opposite edge when reaching the first or last slide.
de: Läuft wieder in die andere Richtung beim Erreichen der ersten oder letzten Folie.

# tinyslider.settings.js.autoHeight.description
source: Height of slider container changes according to each slide’s height.
de: Die Höhe des Sliders ändert sich je nach Höhe der einzelnen Folien.

# tinyslider.settings.js.lazyload.description
source: Enables lazyloading images that are currently not viewed, thus saving bandwidth (see demo). NOTE: + Class .tns-lazy-img need to be set on every image you want to lazyload if option lazyloadSelector is not specified; + data-src attribute with its value of the real image src is required; + width attribute for every image is required for autoWidth slider.
de: Aktiviert lazy loading. Klasse .tns-lazy-img muss bei jedem Bild gesetzt sein welches mit lazy load geladen werden soll falls nichts spezifisches beim lazy load selektor angegeben wurde. data-src Attribut mit dem Pfad der Bildquelle wird benötigt. Das width Attribut wird für jedes Bild benötigt falls autoWidth benutzt wird.

# tinyslider.settings.js.lazyloadSelector.description
source: The CSS selector for lazyload images.
de: Der CSS-Selektor für nachzuladende Bilder mit lazy load.

# tinyslider.settings.js.touch.description
source: Activates input detection for touch devices.
de: Aktiviert Touch-Eingabeerkennung.

# tinyslider.settings.js.mouseDrag.description
source: Changing slides by dragging them.
de: Folienwechsel durch Wischen mit der Maus aktivieren.

# tinyslider.settings.js.swipeAngle.description
source: Swipe or drag will not be triggered if the angle is not inside the range when set.
de: Wischen oder Ziehen wird nicht ausgelöst, wenn der Winkel nicht innerhalb des eingestellten Bereichs liegt.

# tinyslider.settings.js.preventActionWhenRunning.description
source: Prevent next transition while slider is transforming.
de: Verhindert den nächsten Übergang wenn der Slider gerade noch einen Übergang durchführt.

# tinyslider.settings.js.preventScrollOnTouch.description
source: Prevent page from scrolling on touchmove. If set to “auto”, the slider will first check if the touch direction matches the slider axis, then decide whether prevent the page scrolling or not. If set to “force”, the slider will always prevent the page scrolling.
de: Verhindert das Scrollen der Seite beim Berühren. Wenn auf „auto“ gesetzt, wird der Slider zuerst überprüft, ob die Berührungsrichtung mit der Slider-Achse übereinstimmt, dann entscheiden, ob das Scrollen der Seite verhindert wird oder nicht. Wenn auf „erzwingen“ gesetzt wird, verhindert der Slider immer das Scrollen der Seite.

# tinyslider.settings.js.nested.description
source: Define the relationship between nested sliders. Make sure you run the inner slider first, otherwise the height of the inner slider container will be wrong.
de: Definieren Sie die Beziehung zwischen verschachtelten Slidern. Stellen Sie sicher, dass Sie zuerst den inneren Slider ausführen, sonst ist die Höhe des inneren Sliders falsch.

# tinyslider.settings.js.freezable.description
source: Indicate whether the slider will be frozen (controls, nav, autoplay and other functions will stop work) when all slides can be displayed in one page.
de: Geben Sie an, ob der Slider eingefroren wird (Steuerelemente, Nav, Autoplay und andere Funktionen werden nicht funktionieren), wenn alle Folien auf einer Seite angezeigt werden können.

# tinyslider.settings.js.disable.description
source: Disable slider.
de: Slider deaktivieren.

# tinyslider.settings.js.startIndex.description
source: The initial index of the slider.
de: Auf welchem Element soll der Slider starten?
