Repository: WapplerSystems/ws_slider
Catalog: Resources/Private/Language/*.tinyslider.xlf
Languages: de

# settings.mode
source: Mode
de: Modus

# settings.axis
source: Axis
de: Ausrichtung

# settings.items
source: Items
de: Elemente

# settings.responsiveItemCount0
source: Items below 576px display width
de: Elemente unterhalb 576px Displaybreite

# settings.responsiveItemCount576
source: Items above 576px display width
de: Elemente oberhalb 576px Displaybreite

# settings.responsiveItemCount768
source: Items above 768px display width
de: Elemente oberhalb 768px Displaybreite

# settings.responsiveItemCount992
source: Items above 992px display width
de: Elemente oberhalb 992px Displaybreite

# settings.responsiveItemCount1200
source: Items above 1200px display width
de: Elemente oberhalb 1200px Displaybreite

# settings.responsiveItemCount1400
source: Items above 1400px display width
de: Elemente oberhalb 1400px Displaybreite

# settings.gutter
source: Gutter
de: Abstand

# settings.edgePadding
source: Edge Padding
de: Rand Padding

# settings.fixedWidth
source: Fixed Width
de: Feste Breite

# settings.autoWidth
source: Auto Width
de: Automatische Breite

# settings.slideBy
source: Slide By
de: Um x Elemente verschieben

# settings.center
source: Center
de: Zentrierung

# settings.controls
source: Control Buttons
de: Kontrollelemente

# settings.controlsPosition
source: Control Buttons Position
de: Positionen der Kontrollelemente

# settings.controlsContainer
source: Control Buttons Container
de: Container der Kontrollelemente

# settings.customPrevButton
source: Custom Previous-Button
de: Benutzerdefinierter "Vorherige"-Button

# settings.customNextButton
source: Custom Next-Button
de: Benutzerdefinierter "Vorwärts"-Button

# settings.nav
source: Nav Components
de: Navigationspunkte

# settings.navPosition
source: Nav Components Position
de: Position der Navigationspunkte

# settings.navContainer
source: Nav Components Container
de: Container der Navigationspunkte

# settings.navAsThumbnails
source: Nav As Thumbnails
de: Navigationspunkte als Thumbnails

# settings.arrowKeys
source: Arrow Keys
de: Pfeiltasten

# settings.autoplayTimeout
source: Autoplay time between slide changes
de: Autoplay Geschwindigkeit

# settings.autoplayDirection
source: Autoplay Direction
de: Autoplay-Richtung

# settings.autoplayHoverPause
source: Pause autoplay on hover
de: Autoplay beim Hover pausieren

# settings.autoplayResetOnVisibility
source: Pause autoplay when page is invisible
de: Autoplay pausieren, wenn Seite nicht sichtbar ist

# settings.animateNormal
source: Normal Animation
de: Standard Animation

# settings.animateDelay
source: Animation Delay
de: Animationsverzögerung

# settings.rewind
source: Rewind
de: Ans andere Ende laufen

# settings.lazyloadSelector
source: CSS selector for lazyload images
de: CSS-Selektor für nachzuladende Bilder

# settings.mouseDrag
source: Mouse Drag
de: Maus-Steuerung

# settings.swipeAngle
source: Swipe Angle
de: Wischwinkel

# settings.preventActionWhenRunning
source: Prevent next transition while slider is transforming
de: Laufende Aktion blockiert

# settings.preventScrollOnTouch
source: Prevent page from scrolling on touch
de: Verhindert das Scrollen der Seite bei touch-Eingabe

# settings.nested
source: Nested
de: Verschachtelt

# settings.freezable
source: Freezable
de: Einfrierbar

# settings.disable
source: Disable
de: Deaktivieren

# settings.useLocalStorage
source: Use Local Storage
de: Lokalen Speicher verwenden
